Revit 2027 API
LinkElementId.LinkInstanceId Property
 The id of the link, or invalidElementId if no link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkInstanceId { get; }
Public ReadOnly Property LinkInstanceId As ElementId
	Get
public:
property ElementId^ LinkInstanceId {
	ElementId^ get ();
}
member LinkInstanceId : ElementId with get
Property Value
ElementId
See Also
Reference
LinkElementId Class
Autodesk.Revit.DB Namespace